# Да се напише програма, която чете скорост (реално число), въведена от потребителя и отпечатва
# информация за скоростта.
# · При скорост до 10 (включително) отпечатайте "slow"
# · При скорост над 10 и до 50 (включително) отпечатайте "average"
# · При скорост над 50 и до 150 (включително) отпечатайте "fast"
# · При скорост над 150 и до 1000 (включително) отпечатайте "ultra fast"
# ·При по-висока скорост отпечатайте "extremely fast"
speed = float(input())
a = 10
b = 50
c = 150
d = 1000
if speed <= a:
    print("slow")
elif speed <= b:
    print(" average")
elif speed <= c:
    print("fast")
elif speed <= d:
    print("ultra fast")
else:
    print("extremely fast")
